# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
from sklearn import linear_model
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [5]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [6]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
We have two columns with strings and one column with floats.
"""

#### Select the rows where state is New York.

In [10]:
nyc = temp[temp["State"] == "New York"]
nyc

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [17]:
avg_nyc = temp[temp["State"] == "New York"].mean()
avg_nyc

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\4213886779.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  avg_nyc = temp[temp["State"] == "New York"].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [18]:
temp[temp["Temperature"] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [22]:
temp_15 = temp[temp["Temperature"] > 15]

cities = temp_15["City"].unique()
cities

array(['NYC', 'Hartford', 'Treton', 'Newark'], dtype=object)

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [26]:
city = temp[(temp["Temperature"] > 15) & (temp["Temperature"] < 20)]

temp_cities = city["City"].unique()
temp_cities

array(['NYC', 'Hartford'], dtype=object)

#### Find the mean and standard deviation of the temperature of each state.

In [34]:
temp.groupby("State").agg({"Temperature": ["mean", "std"]})

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [38]:
employees = pd.read_csv("Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [40]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
The categorical columns are strings and the columns that have measures are integers
"""

#### What's the average salary in this company?

In [42]:
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [43]:
employees["Salary"].max()

70

#### What's the lowest salary?

In [44]:
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [46]:
min_salary = employees.groupby("Name").agg({"Salary": "min"})

min_salary.sort_values(by = "Salary")

#David and Maria have the lowest salaries.

        Salary
Name
David       30
Maria       30
Jose        35
Sonia       35
Eva         55
Samuel      55
Pedro       60
Ana         70
Carlos      70

#### Find all the information about an employee called David.

In [48]:
david = employees[employees["Name"] == "David"]
david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [49]:
david["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [50]:
employees[employees["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [51]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [56]:
# Method 2
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [57]:
employees[(employees["Title"] == "associate") & (employees["Salary"] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [67]:
year_1 = employees[employees["Years"] == 1]
year_2 = employees[employees["Years"] == 2]
year_3 = employees[employees["Years"] == 3]
year_4 = employees[employees["Years"] == 4]
year_7 = employees[employees["Years"] == 7]
year_8 = employees[employees["Years"] == 8]

In [72]:
year_1.mean()

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\3540855446.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  year_1.mean()

Years      1.0
Salary    35.0
dtype: float64

In [73]:
year_2.mean()

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\247903228.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  year_2.mean()

Years      2.000000
Salary    38.333333
dtype: float64

In [74]:
year_3.mean()

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\2669788241.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  year_3.mean()

Years      3.0
Salary    55.0
dtype: float64

In [75]:
year_4.mean()

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\3491485861.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  year_4.mean()

Years      4.0
Salary    35.0
dtype: float64

In [76]:
year_7.mean()

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\3102777081.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  year_7.mean()

Years      7.0
Salary    60.0
dtype: float64

In [77]:
year_8.mean()

C:\Users\carol\AppData\Local\Temp\ipykernel_16960\2549719899.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  year_8.mean()

Years      8.0
Salary    70.0
dtype: float64

####  What is the average salary per title?

In [81]:
employees.groupby("Title").agg({"Salary": "mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [83]:
q1 = employees["Salary"].quantile(0.25)
q2 = employees["Salary"].quantile(0.50)
q3 = employees["Salary"].quantile(0.75)

print(f"The first quartile is {q1}")
print(f"The second quartile is {q2}")
print(f"The third quartile is {q3}")

The first quartile is 35.0
The second quartile is 55.0
The third quartile is 60.0

#### Is the mean salary different per gender?

In [85]:
employees.groupby("Gender").agg({"Salary": "mean"})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [87]:
employees.groupby("Department")["Salary"].agg(["mean", "min", "max"])

             mean  min  max
Department
HR          45.00   30   70
IT          48.75   30   70
Sales       55.00   55   55

In [88]:
employees.groupby("Department")["Years"].agg(["mean", "min", "max"])

                mean  min  max
Department
HR          4.666667    2    8
IT          4.500000    1    8
Sales       2.500000    2    3

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [89]:
 employees.groupby("Department")["Salary"].agg(lambda x: x.max() - x.min())

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here